Repository: BartuRhymlhold/taleoftalents-django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: tr

source: Tale of Talents
tr: Yetenek Masalları

source: Home
tr: Ana Sayfa

source: Talents
tr: Yetenekler

source: About
tr: Hakkında

source: Sign In
tr: Giriş Yap

source: Register
tr: Kayıt Ol

source: Dashboard
tr: Kontrol Paneli

source: Logout
tr: Çıkış Yap

source: Premium Hospitality Talent Platform
tr: Premium Misafirperverlik Yetenek Platformu

source: Where Hospitality
tr: Misafirperverliğin

source: Dreams Come True
tr: Hayallerin Gerçekleştiği Yer

source: Connect with the world's most exclusive hotels and entertainment venues. Your talent deserves the spotlight it was meant for.
tr: Dünyanın en seçkin otelleri ve eğlence mekanlarıyla bağlantı kurun. Yeteneğiniz hak ettiği spot ışığını bulacak.

source: Start Your Journey
tr: Yolculuğunuza Başlayın

source: Explore Talent
tr: Yetenekleri Keşfedin

source: Verified Talents
tr: Doğrulanmış Yetenekler

source: Partner Hotels
tr: Ortak Oteller

source: Countries
tr: Ülkeler

source: Featured Professionals
tr: Öne Çıkan Profesyoneller

source: Meet Our
tr: Tanışın

source: Star Talents
tr: Yıldız Yeteneklerimizle

source: Discover exceptional professionals who are making waves in the hospitality and entertainment industry
tr: Misafirperverlik ve eğlence sektöründe fark yaratan olağanüstü profesyonelleri keşfedin

source: View Profile
tr: Profili Görüntüle

source: Discover All Talents
tr: Tüm Yetenekleri Keşfedin

source: Join the Elite
tr: Elite Gruba Katılın

source: Ready to Elevate Your
tr: Misafirperverlik Kariyerinizi

source: Hospitality Career?
tr: Yükseltmeye Hazır mısınız?

source: Join thousands of hospitality professionals who have transformed their careers through our exclusive platform. Your dream opportunity is waiting.
tr: Özel platformumuz aracılığıyla kariyerlerini dönüştüren binlerce misafirperverlik profesyoneline katılın. Hayalinizdeki fırsat sizi bekliyor.

source: Start Your Journey Today
tr: Bugün Yolculuğunuza Başlayın

source: professionals already joined
tr: profesyonel zaten katıldı

source: Discover Amazing Talent
tr: Harika Yetenekleri Keşfedin

source: Browse our verified professionals in hospitality and entertainment, ready to bring their skills to your venue.
tr: Misafirperverlik ve eğlence alanında doğrulanmış profesyonellerimizi keşfedin, yeteneklerini mekanınıza getirmeye hazırlar.

source: Search talents...
tr: Yetenek ara...

source: All Talent Types
tr: Tüm Yetenek Türleri

source: All Types
tr: Tüm Türler

source: All Genders
tr: Tüm Cinsiyetler

source: All Locations
tr: Tüm Konumlar

source: Search
tr: Ara

source: Showing
tr: Gösteriliyor

source: talents
tr: yetenek

source: (filtered)
tr: (filtrelenmiş)

source: Clear all filters
tr: Tüm filtreleri temizle

source: No talents found
tr: Yetenek bulunamadı

source: Try adjusting your search criteria or browse all our amazing talents.
tr: Arama kriterlerinizi ayarlamayı deneyin veya tüm harika yeteneklerimizi keşfedin.

source: Clear Filters
tr: Filtreleri Temizle

source: Moderator Dashboard
tr: Moderatör Kontrol Paneli

source: Review and manage talent applications
tr: Yetenek başvurularını inceleyin ve yönetin

source: Total Applications
tr: Toplam Başvuru

source: Pending Review
tr: İnceleme Bekleyen

source: Approved
tr: Onaylanan

source: Rejected
tr: Reddedilen

source: Public
tr: Herkese Açık

source: Search by ID, name, email, or city...
tr: ID, isim, e-posta veya şehir ile ara...

source: All Status
tr: Tüm Durumlar

source: Pending
tr: Bekleyen

source: All Roles
tr: Tüm Roller

source: Talent Applications
tr: Yetenek Başvuruları

source: No applications found
tr: Başvuru bulunamadı

source: Try adjusting your search criteria or browse all applications.
tr: Arama kriterlerinizi ayarlamayı deneyin veya tüm başvuruları keşfedin.
